In [39]:
import pandas as pd
import numpy as np
import dask.dataframe as dd
import matplotlib.pyplot as plt
import warnings
from matplotlib.ticker import PercentFormatter
import seaborn as sns
import boto3
import io

pd.set_option('display.max_columns',None)
warnings.filterwarnings('ignore')

In [40]:
s3 = boto3.client('s3')

# Mention the bucket name where raw data is present
bucket='adl-core-sagemaker-studio'

# Mention the correct directory where raw-data is present, if data is in multiple files make sure all files are present in this directory
file_key = 'external/SDoH/SDoH_Geocoding_Input.csv'

In [41]:
#s3://adl-core-sagemaker-studio/external/SDoH/SDoH_Demographics.csv

In [42]:

s3uri = 's3://{}/{}'.format(bucket, file_key)

df = pd.read_csv(s3uri, dtype={'postal_code': 'string'}, on_bad_lines='skip')

# df = pd.read_csv(s3uri)

df.head()

,udp_global_person_identifier,platform_id,client_id,person_internal_id,address_line_1_text,address_line_2_text,county,city,state,postal_code,postal_code_extnsn,country
0,5ae0dad711a4b928befebe25,936,936,289290011,1000 Nicollet Mall,NaN,NaN,Minneapolis,MN,99999,NaN,USA
1,592055a411a4b937c7344e46,936,936,491590056,1000 NICOLLETT MALL,NaN,NaN,MINNEAPOLIS,MN,99999,NaN,USA
2,58cb485cdab54b14d1856a95,936,936,159590029,1000 NICOLLETT MALL,NaN,NaN,MINNEAPOLIS,MN,99999,NaN,USA
3,5ae0dac411a4b928befeb762,936,936,199490041,1000 NICOLLETT MALL,NaN,NaN,MINNEAPOLIS,MN,99999,NaN,USA
4,5ae0dad411a4b928befebce3,936,936,214590063,1000 NICOLLETT MALL,NaN,NaN,MINNEAPOLIS,MN,99999,NaN,USA

In [43]:
df.columns

Index(['udp_global_person_identifier', 'platform_id', 'client_id',
       'person_internal_id', 'address_line_1_text', 'address_line_2_text',
       'county', 'city', 'state', 'postal_code', 'postal_code_extnsn',
       'country'],
      dtype='object')

In [44]:
df.isna().sum()

udp_global_person_identifier    220791
platform_id                          0
client_id                            0
person_internal_id                   0
address_line_1_text                  2
address_line_2_text             628401
county                          688613
city                                 1
state                               55
postal_code                         26
postal_code_extnsn              690744
country                              1
dtype: int64

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 690744 entries, 0 to 690743
Data columns (total 12 columns):
 #   Column                        Non-Null Count   Dtype
---  ------                        --------------   -----
 0   udp_global_person_identifier  469953 non-null  object
 1   platform_id                   690744 non-null  int64
 2   client_id                     690744 non-null  int64
 3   person_internal_id            690744 non-null  int64
 4   address_line_1_text           690742 non-null  object
 5   address_line_2_text           62343 non-null   object
 6   county                        2131 non-null    object
 7   city                          690743 non-null  object
 8   state                         690689 non-null  object
 9   postal_code                   690718 non-null  string
 10  postal_code_extnsn            0 non-null       float64
 11  country                       690743 non-null  object
dtypes: float64(1), int64(3), object(7), string(1)
memory usage: 63.2+ MB

In [46]:
df.shape

(690744, 12)

In [47]:
new_df = df.groupby(['address_line_1_text','city','state','postal_code']).sum().reset_index()

In [48]:
group = new_df[['address_line_1_text','city','state','postal_code']]

In [49]:
group.shape

(668039, 4)

In [50]:
group

            address_line_1_text          city state postal_code
0       # 3 Villa Paseos Avenue     Vega Baja    PR         693
1              #1 Ne 48Th Place        Lawton    OK       73507
2       #1 Scott Circle Apt 611    Washington    DC       20036
3         #1-82 Collier Road SE  Medicine Hat    AB      T1B1H7
4            #2 LAST CHANCE CT.    ST. PETERS    MO   633760000
...                         ...           ...   ...         ...
668034           villa carolina      Carolina    PR         985
668035       w2522 wedgewood ct      Appleton    WI       54915
668036            w3812 Hull Rd       Horicon    WI       53032
668037  w4442 mary hill park dr   Fond du lac    WI       54937
668038           w788 Violet rd    Genoa City    WI       53128

[668039 rows x 4 columns]

In [51]:
group["address_line_1_text"] = group["address_line_1_text"].str.replace("#","")

In [52]:
group.head()

      address_line_1_text          city state postal_code
0   3 Villa Paseos Avenue     Vega Baja    PR         693
1         1 Ne 48Th Place        Lawton    OK       73507
2  1 Scott Circle Apt 611    Washington    DC       20036
3    1-82 Collier Road SE  Medicine Hat    AB      T1B1H7
4       2 LAST CHANCE CT.    ST. PETERS    MO   633760000

In [53]:
group.reset_index(inplace=True)

In [55]:
group.index = np.arange(1, len(group) + 1)
group.head()

   index     address_line_1_text          city state postal_code
1      0   3 Villa Paseos Avenue     Vega Baja    PR         693
2      1         1 Ne 48Th Place        Lawton    OK       73507
3      2  1 Scott Circle Apt 611    Washington    DC       20036
4      3    1-82 Collier Road SE  Medicine Hat    AB      T1B1H7
5      4       2 LAST CHANCE CT.    ST. PETERS    MO   633760000

In [56]:
group.drop(['index'],axis=1,inplace=True)

In [57]:
import re

def make_zipcode_5digit(zipcode):
    if zipcode.isdigit()==False:
        zipcode = re.sub('\D', '', zipcode)
    if len(zipcode)<5:
        i = 5-len(zipcode)
        zipcode = ('0'*i)+zipcode
    if len(zipcode)>5:
        zipcode = zipcode[:5]
    return zipcode

In [36]:
# make_zipcode_5digit('T1B1H7')

In [37]:
# make_zipcode_5digit('633760000')

In [58]:
group['postal_code']=group['postal_code'].apply(make_zipcode_5digit)

In [70]:
group['address_line_1_text'] = group['address_line_1_text'].apply(lambda x: x.strip('.#@!$%^&*'))

In [71]:
group.head()

      address_line_1_text          city state postal_code
1   3 Villa Paseos Avenue     Vega Baja    PR       00693
2         1 Ne 48Th Place        Lawton    OK       73507
3  1 Scott Circle Apt 611    Washington    DC       20036
4    1-82 Collier Road SE  Medicine Hat    AB       00117
5        2 LAST CHANCE CT    ST. PETERS    MO       63376

In [ ]:
#Unique ID, Street address, City, State, ZIP

In [72]:
group.isna().sum()

address_line_1_text    0
city                   0
state                  0
postal_code            0
dtype: int64

In [73]:
group.shape

(668039, 4)

In [74]:
group[0:10000]

          address_line_1_text          city state postal_code
1       3 Villa Paseos Avenue     Vega Baja    PR       00693
2             1 Ne 48Th Place        Lawton    OK       73507
3      1 Scott Circle Apt 611    Washington    DC       20036
4        1-82 Collier Road SE  Medicine Hat    AB       00117
5            2 LAST CHANCE CT    ST. PETERS    MO       63376
...                       ...           ...   ...         ...
9996      1011a Southside Ave     Nashville    TN       37203
9997                     1012      ECLECTIC    AL       36024
9998       1012 1/2 N 12TH ST      BISMARCK    ND       58501
9999     1012 169TH ST APT 3B       HAMMOND    IN       46324
10000  1012 16th Avenue South    Birmingham    AL       35205

[10000 rows x 4 columns]

In [75]:
for row in range(0,len(group),10000):
    group[row : row+10000].to_csv(f'census/data_{row}_{row+10000}.csv',index=True,header=False)